Revit 2024 API
ExternallyTaggedGeometryObject.ExternalId Property
 The external Id of the geometry object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public ExternalGeometryId ExternalId { get; }
Visual Basic
Public ReadOnly Property ExternalId As ExternalGeometryId
	Get
Visual C++
public:
property ExternalGeometryId^ ExternalId {
	ExternalGeometryId^ get ();
}
See Also
ExternallyTaggedGeometryObject Class
Autodesk.Revit.DB Namespace